# Many to Many Relationships

Think about a Human Resources database for a large company

* Departments
* Employees
* Titles
* Managers
* Salaries

The start of a data model

![](manymany.png)

## Evolving a Many to Many

![](intersectionentity.png)

## From Model to Table

```
employees=# \d departments
          Table "public.departments"
  Column   |         Type          | Modifiers
-----------+-----------------------+-----------
 dept_no   | character(4)          | not null
 dept_name | character varying(40) | not null


employees=# \d dept_emp
       Table "public.dept_emp"
  Column   |     Type     | Modifiers
-----------+--------------+-----------
 emp_no    | integer      | not null
 dept_no   | character(4) | not null
 from_date | date         | not null
 to_date   | date         | not null


employees=# \d employees
            Table "public.employees"
   Column   |         Type          | Modifiers
------------+-----------------------+-----------
 emp_no     | integer               | not null
 birth_date | date                  | not null
 first_name | character varying(14) | not null
 last_name  | character varying(16) | not null
 gender     | character varying(1)  | not null
 hire_date  | date                  | not null

```

In [62]:
import warnings
warnings.filterwarnings('ignore')

In [63]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
%sql postgresql://millbr02:@localhost/employees

'Connected: millbr02@employees'

In [93]:
%%sql

select dept_name, count(*) 
from departments natural join dept_emp 
where  now() < to_date
group by dept_name
order by count

9 rows affected.

[('Finance', 12437),
 ('Human Resources', 12898),
 ('Quality Management', 14546),
 ('Marketing', 14842),
 ('Research', 15441),
 ('Customer Service', 17569),
 ('Sales', 37701),
 ('Production', 53304),
 ('Development', 61386)]

OK, that is mildly interesting, but we can ask something more interesting, such as how many employees currently work for the marketing department?

In [78]:
%%sql

select dept_name, count(*) 
from departments natural join dept_emp 
where now() < to_date
group by dept_name

9 rows affected.

[('Research', 15441),
 ('Sales', 37701),
 ('Customer Service', 17569),
 ('Marketing', 14842),
 ('Human Resources', 12898),
 ('Production', 53304),
 ('Quality Management', 14546),
 ('Development', 61386),
 ('Finance', 12437)]

1. **Note:** the ``now()`` function is just a convenience for manually entereing the current date.
2. **Note:** we can use aggregates without a grouby, realizing that said aggregate applies to the whole result.

In [80]:
%%sql

2 rows affected.

[('Margareta', 'Markovitch', 'Marketing'),
 ('Vishwani', 'Minakawa', 'Marketing')]

In [96]:
%%sql 

select first_name, last_name, from_date, to_date
from departments natural join dept_manager natural join employees 
where dept_name = 'Sales'

2 rows affected.

[('Przemyslawa', 'Kaelbling', datetime.date(1985, 1, 1), datetime.date(1991, 3, 7)),
 ('Hauke', 'Zhang', datetime.date(1991, 3, 7), datetime.date(9999, 1, 1))]

## The Final LDS

![](employeedb.png)

In [24]:
%%sql

select dept_name, first_name, last_name
from departments natural join dept_manager natural join employees 
where now() < to_date;

9 rows affected.

[('Marketing', 'Vishwani', 'Minakawa'),
 ('Finance', 'Isamu', 'Legleitner'),
 ('Human Resources', 'Karsten', 'Sigstam'),
 ('Production', 'Oscar', 'Ghazalie'),
 ('Development', 'Leon', 'DasSarma'),
 ('Quality Management', 'Dung', 'Pesch'),
 ('Sales', 'Hauke', 'Zhang'),
 ('Research', 'Hilary', 'Kambil'),
 ('Customer Service', 'Yuchang', 'Weedman')]

In [64]:
%sql select distinct title from titles

7 rows affected.

[('Technique Leader',),
 ('Senior Engineer',),
 ('Staff',),
 ('Assistant Engineer',),
 ('Engineer',),
 ('Senior Staff',),
 ('Manager',)]

In [58]:
%%sql

select * 
from departments natural join dept_emp 
natural join employees natural join salaries limit 10;

10 rows affected.

[(286829, datetime.date(1994, 3, 14), datetime.date(1995, 1, 11), 'd001', 'Marketing', datetime.date(1954, 11, 10), 'Kazuhisa', 'Vecchio', 'F', datetime.date(1986, 3, 17), 48149),
 (476388, datetime.date(1995, 9, 21), datetime.date(1995, 11, 28), 'd001', 'Marketing', datetime.date(1960, 7, 1), 'Elvis', 'Kroll', 'M', datetime.date(1991, 10, 13), 65007),
 (210440, datetime.date(1996, 9, 18), datetime.date(1996, 11, 10), 'd001', 'Marketing', datetime.date(1964, 7, 11), 'Chandrasekaran', 'Vernadat', 'M', datetime.date(1994, 6, 10), 49760),
 (465625, datetime.date(1996, 10, 4), datetime.date(1997, 7, 7), 'd001', 'Marketing', datetime.date(1961, 10, 2), 'Claudi', 'Piveteau', 'M', datetime.date(1996, 10, 4), 49259),
 (19196, datetime.date(2000, 1, 28), datetime.date(2000, 5, 12), 'd001', 'Marketing', datetime.date(1956, 8, 10), 'Leucio', 'Sury', 'M', datetime.date(1988, 9, 3), 66890),
 (259294, datetime.date(1991, 2, 7), datetime.date(1991, 5, 17), 'd001', 'Marketing', datetime.date(1962, 3, 13), 'Demos', 'Peyn', 'F', datetime.date(1988, 1, 26), 66971),
 (80329, datetime.date(1999, 8, 6), datetime.date(1999, 9, 5), 'd001', 'Marketing', datetime.date(1959, 9, 9), 'Moon', 'Ponthieu', 'F', datetime.date(1988, 11, 7), 40000),
 (268194, datetime.date(1994, 5, 27), datetime.date(1994, 6, 29), 'd001', 'Marketing', datetime.date(1960, 2, 12), 'Gila', 'Aamodt', 'F', datetime.date(1994, 4, 6), 70796),
 (294469, datetime.date(1995, 8, 17), datetime.date(1996, 5, 22), 'd001', 'Marketing', datetime.date(1960, 7, 18), 'Tetsushi', 'Biran', 'M', datetime.date(1987, 6, 21), 68907),
 (12505, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), 'd001', 'Marketing', datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 40423)]

## Question --

The above query seems OK, but there is a problem.  Can you spot what it is?

We know that our friend Barton Goldhammer worked here for more than a year, lets use the above query but limit it to him.  We want to snoop on our friend's salary history...

In [97]:
%%sql

select * 
from departments natural join dept_emp 
natural join employees natural join salaries
where employees.emp_no = 12505

1 rows affected.

[(12505, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), 'd001', 'Marketing', datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 40423)]

Thats even more odd.  Only one row, we know he worked in both marketing and sales and was here until at least 2002.

Think about the `natural join` again...

## JOIN ON

In [99]:
%%sql

select * 
from departments natural join dept_emp natural join employees 
join salaries on employees.emp_no = salaries.emp_no 
where employees.emp_no = 12505
order by salaries.from_date;

6 rows affected.

[(12505, 'd001', 'Marketing', datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 40423, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23)),
 (12505, 'd007', 'Sales', datetime.date(2000, 8, 23), datetime.date(2002, 2, 18), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 40423, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23)),
 (12505, 'd001', 'Marketing', datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43758, datetime.date(2000, 8, 23), datetime.date(2001, 8, 23)),
 (12505, 'd007', 'Sales', datetime.date(2000, 8, 23), datetime.date(2002, 2, 18), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43758, datetime.date(2000, 8, 23), datetime.date(2001, 8, 23)),
 (12505, 'd001', 'Marketing', datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43942, datetime.date(2001, 8, 23), datetime.date(2002, 2, 18)),
 (12505, 'd007', 'Sales', datetime.date(2000, 8, 23), datetime.date(2002, 2, 18), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43942, datetime.date(2001, 8, 23), datetime.date(2002, 2, 18))]

What is the average salary of the marketing department?

In [29]:
%%sql

select dept_name, min(salary), avg(salary), max(salary)
from  departments natural join dept_emp natural join employees natural join salaries
group by dept_name

9 rows affected.

[('Customer Service', 40000, Decimal('43684.347826086957'), 91638),
 ('Development', 40000, Decimal('49085.105339105339'), 100285),
 ('Finance', 40000, Decimal('61479.844705882353'), 105985),
 ('Human Resources', 40000, Decimal('43069.742788461538'), 73900),
 ('Marketing', 40000, Decimal('59373.385714285714'), 100242),
 ('Production', 40000, Decimal('49057.929073856975'), 98370),
 ('Quality Management', 40000, Decimal('46026.197183098592'), 79334),
 ('Research', 40000, Decimal('49130.981818181818'), 81790),
 ('Sales', 40000, Decimal('69663.258899676375'), 112513)]

In [41]:
%%sql

80 rows affected.

[('Przemyslawa', 'Kaelbling', datetime.date(1985, 1, 1)),
 ('Adil', 'Furedi', datetime.date(1985, 2, 1)),
 ('Shir', 'Munck', datetime.date(1985, 2, 1)),
 ('Yongdong', 'Pileggi', datetime.date(1985, 2, 1)),
 ('Guenter', 'Tanemo', datetime.date(1985, 2, 2)),
 ('Erzsebet', 'Schwartzbauer', datetime.date(1985, 2, 2)),
 ('Kousuke', 'Swist', datetime.date(1985, 2, 2)),
 ('Chaosheng', 'Sommen', datetime.date(1985, 2, 2)),
 ('Holgard', 'Pena', datetime.date(1985, 2, 2)),
 ('Limsoon', 'Macedo', datetime.date(1985, 2, 2)),
 ('Jingling', 'Vesna', datetime.date(1985, 2, 2)),
 ('Toney', 'Skrikant', datetime.date(1985, 2, 2)),
 ('Phillip', 'Teitelbaum', datetime.date(1985, 2, 2)),
 ('Gay', 'Kumaresan', datetime.date(1985, 2, 2)),
 ('Xinglin', 'Marakhovsky', datetime.date(1985, 2, 2)),
 ('Keung', 'Peak', datetime.date(1985, 2, 2)),
 ('Chikako', 'Malabarba', datetime.date(1985, 2, 2)),
 ('Nagui', 'DiGiano', datetime.date(1985, 2, 2)),
 ('Zita', 'Vural', datetime.date(1985, 2, 3)),
 ('Nectarios', 'Perna', datetime.date(1985, 2, 3)),
 ('Premsyl', 'Nitto', datetime.date(1985, 2, 3)),
 ('Chiranjit', 'Stemann', datetime.date(1985, 2, 3)),
 ('Fumitaka', 'Boyle', datetime.date(1985, 2, 3)),
 ('Arup', 'Krohm', datetime.date(1985, 2, 3)),
 ('Fumiyo', 'Cronau', datetime.date(1985, 2, 3)),
 ('Aleksander', 'Masaki', datetime.date(1985, 2, 3)),
 ('Godehard', 'Conte', datetime.date(1985, 2, 3)),
 ('Halsur', 'Birrer', datetime.date(1985, 2, 3)),
 ('Huan', 'Dahlbom', datetime.date(1985, 2, 3)),
 ('Shakhar', 'Sgarro', datetime.date(1985, 2, 3)),
 ('Surveyors', 'Badache', datetime.date(1985, 2, 3)),
 ('Mitchel', 'Gustavson', datetime.date(1985, 2, 3)),
 ('Moti', 'Oppitz', datetime.date(1985, 2, 4)),
 ('Arto', 'Argence', datetime.date(1985, 2, 4)),
 ('Lech', 'Linnainmaa', datetime.date(1985, 2, 4)),
 ('Stafford', 'Luce', datetime.date(1985, 2, 4)),
 ('Fox', 'Waschkowski', datetime.date(1985, 2, 4)),
 ('Khalid', 'Salinas', datetime.date(1985, 2, 4)),
 ('Goa', 'Parfitt', datetime.date(1985, 2, 4)),
 ('Eberhardt', 'Pramanik', datetime.date(1985, 2, 4)),
 ('Xiong', 'Chenoweth', datetime.date(1985, 2, 4)),
 ('Tran', 'Jiang', datetime.date(1985, 2, 4)),
 ('Limsoon', 'Bage', datetime.date(1985, 2, 5)),
 ('Boutros', 'Velardi', datetime.date(1985, 2, 5)),
 ('Ohad', 'Srimani', datetime.date(1985, 2, 5)),
 ('Niteen', 'Matteis', datetime.date(1985, 2, 5)),
 ('Vasilis', 'Pettis', datetime.date(1985, 2, 5)),
 ('Berry', 'Dulli', datetime.date(1985, 2, 5)),
 ('Heather', 'Paciorek', datetime.date(1985, 2, 5)),
 ('Jaques', 'Hashii', datetime.date(1985, 2, 5)),
 ('Rance', 'Chepyzhov', datetime.date(1985, 2, 5)),
 ('Goh', 'Linnainmaa', datetime.date(1985, 2, 5)),
 ('Elvia', 'Baalen', datetime.date(1985, 2, 5)),
 ('Goa', 'Swick', datetime.date(1985, 2, 5)),
 ('Ulf', 'Demos', datetime.date(1985, 2, 5)),
 ('Ramalingam', 'Validov', datetime.date(1985, 2, 5)),
 ('Gregory', 'Griswold', datetime.date(1985, 2, 5)),
 ('Mariusz', 'Pokrovskii', datetime.date(1985, 2, 5)),
 ('Shaleah', 'Panwar', datetime.date(1985, 2, 5)),
 ('Amalendu', 'Hiyoshi', datetime.date(1985, 2, 5)),
 ('Chiranjit', 'Ghelli', datetime.date(1985, 2, 5)),
 ('Miyeon', 'Yemenis', datetime.date(1985, 2, 5)),
 ('Bedrich', 'Lubachevsky', datetime.date(1985, 2, 5)),
 ('Ipke', 'Zallocco', datetime.date(1985, 2, 6)),
 ('Elvia', 'Christ', datetime.date(1985, 2, 6)),
 ('Noritoshi', 'Luff', datetime.date(1985, 2, 6)),
 ('Kagan', 'Radhakrishnan', datetime.date(1985, 2, 6)),
 ('Xiaoqiang', 'Ferriere', datetime.date(1985, 2, 6)),
 ('Uriel', 'Daescu', datetime.date(1985, 2, 6)),
 ('Dhritiman', 'Masamoto', datetime.date(1985, 2, 6)),
 ('Sumant', 'Ertl', datetime.date(1985, 2, 6)),
 ('Hugo', 'Griswold', datetime.date(1985, 2, 6)),
 ('Pragnesh', 'Orlowska', datetime.date(1985, 2, 6)),
 ('Ranan', 'Demir', datetime.date(1985, 2, 6)),
 ('Mohua', 'Pocchiola', datetime.date(1985, 2, 6)),
 ('Xianlong', 'Trachtenberg', datetime.date(1985, 2, 6)),
 ('Nakhoon', 'Falby', datetime.date(1985, 2, 6)),
 ('Horward', 'Steenbeek', datetime.date(1985, 2, 6)),
 ('Adil', 'Uludag', datetime.date(1985, 2, 6)),
 ('Aimee', 'Baja', datetime.date(1985, 2, 6))]

In [44]:
%sql select last_name, count(*) from employees group by last_name order by count(*)  limit 10;

10 rows affected.

[('Sadowsky', 145),
 ('Merro', 147),
 ('Zykh', 148),
 ('Georgatos', 148),
 ('Guardalben', 148),
 ('Rosar', 150),
 ('Zambonelli', 151),
 ('Gonthier', 151),
 ('Nollmann', 151),
 ('Dulli', 151)]

![](nj_v_j.png)

```
select * from
dept_emp natural join salaries
```

```
emp_no  dept_no from to salary
1       2       X    Y  10
```


```
select * from
dept_emp join salaries on dept_emp.emp_no = salaries.emp_no
```



```
emp_no   dept_no  from_1  to_1 from_2 to_2 salary
1        2        X       Y    X      Y    10
1        3        Y       X    X      Y    10
2        1        X       Y    Y      Z    12

```

example queries

* find the salary history for Holgard Pena
* find the job title history for Holgard Pena
* current job title counts per department
* average salary by job title  - based on current salary and current title
* who has held the most titles?

In [136]:
%%sql

select  emp_no, to_char(salary,'$999,999.00'), from_date, to_date 
from employees natural join salaries
where first_name = 'Holgard' and last_name='Pena';

13 rows affected.

[(241707, '$  83,852.00', datetime.date(1990, 4, 1), datetime.date(1991, 4, 1)),
 (241707, '$  84,691.00', datetime.date(1991, 4, 1), datetime.date(1992, 3, 31)),
 (241707, '$  88,281.00', datetime.date(1992, 3, 31), datetime.date(1993, 3, 31)),
 (241707, '$  89,637.00', datetime.date(1993, 3, 31), datetime.date(1994, 3, 31)),
 (241707, '$  92,069.00', datetime.date(1994, 3, 31), datetime.date(1995, 3, 31)),
 (241707, '$  93,627.00', datetime.date(1995, 3, 31), datetime.date(1996, 3, 30)),
 (241707, '$  93,471.00', datetime.date(1996, 3, 30), datetime.date(1997, 3, 30)),
 (241707, '$  95,055.00', datetime.date(1997, 3, 30), datetime.date(1998, 3, 30)),
 (241707, '$  97,593.00', datetime.date(1998, 3, 30), datetime.date(1999, 3, 30)),
 (241707, '$ 101,019.00', datetime.date(1999, 3, 30), datetime.date(2000, 3, 29)),
 (241707, '$ 104,816.00', datetime.date(2000, 3, 29), datetime.date(2001, 3, 29)),
 (241707, '$ 106,174.00', datetime.date(2001, 3, 29), datetime.date(2002, 3, 29)),
 (241707, '$ 107,028.00', datetime.date(2002, 3, 29), datetime.date(9999, 1, 1))]

In [108]:
%%sql

select title, from_date, to_date
from employees natural join titles
where first_name = 'Holgard' and last_name = 'Pena';

2 rows affected.

[('Senior Staff', datetime.date(1996, 3, 31), datetime.date(9999, 1, 1)),
 ('Staff', datetime.date(1990, 4, 1), datetime.date(1996, 3, 31))]

In [137]:
%%sql

select dept_name, title, count(*)
from departments natural join dept_emp  
   join titles on dept_emp.emp_no = titles.emp_no
where now() < titles.to_date
group by dept_name, title
order by dept_name, title

45 rows affected.

[('Customer Service', 'Assistant Engineer', 298),
 ('Customer Service', 'Engineer', 2362),
 ('Customer Service', 'Manager', 4),
 ('Customer Service', 'Senior Engineer', 2027),
 ('Customer Service', 'Senior Staff', 13925),
 ('Customer Service', 'Staff', 16150),
 ('Customer Service', 'Technique Leader', 309),
 ('Development', 'Assistant Engineer', 7769),
 ('Development', 'Engineer', 58135),
 ('Development', 'Manager', 2),
 ('Development', 'Senior Engineer', 49326),
 ('Development', 'Senior Staff', 1247),
 ('Development', 'Staff', 1424),
 ('Development', 'Technique Leader', 7683),
 ('Finance', 'Manager', 2),
 ('Finance', 'Senior Staff', 12139),
 ('Finance', 'Staff', 13929),
 ('Human Resources', 'Manager', 2),
 ('Human Resources', 'Senior Staff', 12274),
 ('Human Resources', 'Staff', 14342),
 ('Marketing', 'Manager', 2),
 ('Marketing', 'Senior Staff', 13940),
 ('Marketing', 'Staff', 16196),
 ('Production', 'Assistant Engineer', 6445),
 ('Production', 'Engineer', 49649),
 ('Production', 'Manager', 4),
 ('Production', 'Senior Engineer', 42205),
 ('Production', 'Senior Staff', 1270),
 ('Production', 'Staff', 1478),
 ('Production', 'Technique Leader', 6557),
 ('Quality Management', 'Assistant Engineer', 1831),
 ('Quality Management', 'Engineer', 13852),
 ('Quality Management', 'Manager', 4),
 ('Quality Management', 'Senior Engineer', 11864),
 ('Quality Management', 'Technique Leader', 1795),
 ('Research', 'Assistant Engineer', 378),
 ('Research', 'Engineer', 2986),
 ('Research', 'Manager', 2),
 ('Research', 'Senior Engineer', 2570),
 ('Research', 'Senior Staff', 11637),
 ('Research', 'Staff', 13495),
 ('Research', 'Technique Leader', 393),
 ('Sales', 'Manager', 2),
 ('Sales', 'Senior Staff', 36191),
 ('Sales', 'Staff', 41808)]

In [139]:
%%sql

select title, to_char(avg(salary), '999,999.99') AvgSalary
from titles join salaries on titles.emp_no = salaries.emp_no
where now() < salaries.to_date and now() < titles.to_date
group by title
order by avgsalary desc

7 rows affected.

[('Senior Staff', '  80,706.50'),
 ('Manager', '  77,723.67'),
 ('Senior Engineer', '  70,823.44'),
 ('Technique Leader', '  67,506.59'),
 ('Staff', '  67,330.67'),
 ('Engineer', '  59,602.74'),
 ('Assistant Engineer', '  57,317.57')]

In [126]:
%%sql

select title, avg(salary)
from titles join salaries on titles.emp_no = salaries.emp_no
where now() < salaries.to_date
group by title

7 rows affected.

[('Technique Leader', Decimal('67507.982336843851')),
 ('Senior Engineer', Decimal('70823.401933862372')),
 ('Staff', Decimal('77513.734018609184')),
 ('Assistant Engineer', Decimal('67433.362527992038')),
 ('Senior Staff', Decimal('80705.985529860662')),
 ('Engineer', Decimal('67941.020444176638')),
 ('Manager', Decimal('79546.250000000000'))]

In [129]:
%%sql

select *
from titles join salaries on titles.emp_no = salaries.emp_no
where now() < salaries.to_date and now() < titles.to_date 
limit 20;

20 rows affected.

[(95972, 'Technique Leader', datetime.date(1991, 7, 20), datetime.date(9999, 1, 1), 95972, 65293, datetime.date(2002, 7, 17), datetime.date(9999, 1, 1)),
 (95973, 'Senior Engineer', datetime.date(2000, 8, 20), datetime.date(9999, 1, 1), 95973, 62266, datetime.date(2001, 8, 18), datetime.date(9999, 1, 1)),
 (95974, 'Engineer', datetime.date(2001, 1, 21), datetime.date(9999, 1, 1), 95974, 53334, datetime.date(2002, 1, 20), datetime.date(9999, 1, 1)),
 (95976, 'Senior Staff', datetime.date(1998, 8, 9), datetime.date(9999, 1, 1), 95976, 41528, datetime.date(2001, 8, 8), datetime.date(9999, 1, 1)),
 (95977, 'Engineer', datetime.date(1998, 11, 27), datetime.date(9999, 1, 1), 95977, 55132, datetime.date(2001, 11, 26), datetime.date(9999, 1, 1)),
 (95978, 'Senior Staff', datetime.date(1994, 4, 7), datetime.date(9999, 1, 1), 95978, 77320, datetime.date(2002, 4, 3), datetime.date(9999, 1, 1)),
 (95979, 'Staff', datetime.date(1995, 9, 15), datetime.date(9999, 1, 1), 95979, 54743, datetime.date(2001, 9, 13), datetime.date(9999, 1, 1)),
 (95980, 'Senior Engineer', datetime.date(1999, 1, 2), datetime.date(9999, 1, 1), 95980, 58392, datetime.date(2001, 12, 30), datetime.date(9999, 1, 1)),
 (95981, 'Senior Engineer', datetime.date(1999, 10, 7), datetime.date(9999, 1, 1), 95981, 60292, datetime.date(2001, 10, 4), datetime.date(9999, 1, 1)),
 (95982, 'Senior Staff', datetime.date(2001, 11, 18), datetime.date(9999, 1, 1), 95982, 74959, datetime.date(2001, 11, 17), datetime.date(9999, 1, 1)),
 (95983, 'Technique Leader', datetime.date(1995, 9, 27), datetime.date(9999, 1, 1), 95983, 64619, datetime.date(2001, 9, 25), datetime.date(9999, 1, 1)),
 (95985, 'Senior Engineer', datetime.date(1994, 7, 26), datetime.date(9999, 1, 1), 95985, 63820, datetime.date(2002, 7, 22), datetime.date(9999, 1, 1)),
 (95986, 'Engineer', datetime.date(1995, 1, 15), datetime.date(9999, 1, 1), 95986, 49903, datetime.date(2002, 1, 13), datetime.date(9999, 1, 1)),
 (95987, 'Senior Staff', datetime.date(2002, 3, 4), datetime.date(9999, 1, 1), 95987, 77160, datetime.date(2002, 3, 2), datetime.date(9999, 1, 1)),
 (95990, 'Engineer', datetime.date(1996, 9, 4), datetime.date(9999, 1, 1), 95990, 77989, datetime.date(2001, 9, 3), datetime.date(9999, 1, 1)),
 (95991, 'Senior Staff', datetime.date(2001, 11, 13), datetime.date(9999, 1, 1), 95991, 71651, datetime.date(2001, 11, 12), datetime.date(9999, 1, 1)),
 (95992, 'Senior Engineer', datetime.date(1995, 9, 18), datetime.date(9999, 1, 1), 95992, 67157, datetime.date(2001, 9, 14), datetime.date(9999, 1, 1)),
 (95993, 'Senior Staff', datetime.date(1992, 1, 26), datetime.date(9999, 1, 1), 95993, 115980, datetime.date(2002, 1, 23), datetime.date(9999, 1, 1)),
 (95994, 'Senior Staff', datetime.date(1993, 9, 24), datetime.date(9999, 1, 1), 95994, 124605, datetime.date(2001, 9, 21), datetime.date(9999, 1, 1)),
 (95996, 'Senior Engineer', datetime.date(1993, 12, 25), datetime.date(9999, 1, 1), 95996, 80066, datetime.date(2001, 12, 23), datetime.date(9999, 1, 1))]